weilan157/Lero-Voice/sdkconfig.defaults
# Lero Voice default configuration (docs/PLAN.md)
# Target / flash
CONFIG_IDF_TARGET="esp32s31"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# Partition table (custom CSV, see partitions.csv)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# OTA rollback support (docs/PLAN.md 8.1)
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# Static allocation (docs/PLAN.md 3.4 rule 2)
CONFIG_FREERTOS_SUPPORT_STATIC_ALLOCATION=y
CONFIG_FREERTOS_HZ=1000

# Task diagnostics (diag_console "tasks" command uses uxTaskGetSystemState)
CONFIG_FREERTOS_USE_TRACE_FACILITY=y

# Logging (docs/PLAN.md 3.8.4)
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3

# Debug: UART console on CN2 + coredump partition (docs/PLAN.md 3.8.1)
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
# 注：IDF master 已移除 ESP_COREDUMP_DATA_FORMAT_ELF 符号（格式选项被
# 重构），删去该行避免 unknown kconfig symbol 警告，用 master 默认格式。

# PSRAM: RGB frame buffers are statically allocated in PSRAM (docs/PLAN.md 3.3.1 #4)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y

# LVGL (esp_lvgl_adapter, official S31 scheme; docs/PLAN.md 2.4.2e)
# 16-bit color (RGB565, panel driven at 16-bit with high bits effective)
CONFIG_LV_COLOR_DEPTH_16=y
# Use standard C malloc (IDF heap, PSRAM capable) instead of LVGL builtin 64KB pool.
# NOTE: LVGL 9 renamed LVGL8's LV_MEM_CUSTOM to the "Malloc functions source" choice
# (LV_USE_CLIB_MALLOC); official S31 factory_demo uses the same option.
CONFIG_LV_USE_CLIB_MALLOC=y
# Official benchmark demo (shows FPS) on boot
CONFIG_LV_USE_DEMO_BENCHMARK=y

# Bluetooth Classic A2DP sink（手机蓝牙放歌 → ES8389；S31 支持，见 PLAN 6.4）
CONFIG_BT_ENABLED=y
CONFIG_BTDM_CTRL_MODE_BR_EDR_ONLY=y
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BT_A2DP_ENABLE=y

# 播放端单声道 → 立体声（ESP-GMF 通道转换；BCLK PIN 模式按立体声查
# 系数表，单声道流会 BCLK 减半变调——官方测试板同样先转立体声）
CONFIG_ESP_AUDIO_SIMPLE_PLAYER_CH_CVT_EN=y
